<template>
  <q-input
    v-model="newMessageText"
    rounded
    outlined
    type="text"
    placeholder="Ваше сообщение..."
    input-style="padding-left: 12px; padding-bottom: 12px;"
  >
  </q-input>
</template>

<script setup lang="ts">
import { ref, onMounted } from 'vue';

const prompts = [
  { emoji: '📚', text: 'Подготовь задания для изучения слов' },
  { emoji: '📝', text: 'Подготовь к экзамену' },
  { emoji: '🎨', text: 'Предложи идею для картины' },
  { emoji: '🎬', text: 'Посоветуй фильм на вечер' },
  { emoji: '📅', text: 'Организуй мой день' },
  { emoji: '💡', text: 'Предложи идею для стартапа' },
  { emoji: '🍲', text: 'Подбери рецепт на ужин' },
  { emoji: '🚀', text: 'Объясни концепцию космоса' },
  { emoji: '🧳', text: 'Составь план путешествия' },
  { emoji: '🏋️‍♂️', text: 'Сделай программу тренировок' },
  { emoji: '🎧', text: 'Подбери плейлист для работы' },
  { emoji: '💼', text: 'Помоги написать резюме' },
  { emoji: '💬', text: 'Составь текст для презентации' },
  { emoji: '🌍', text: 'Интересные места в мире' },
  { emoji: '👨‍🍳', text: 'Предложи оригинальное блюдо' },
  { emoji: '📅', text: 'Запланируй неделю' },
  { emoji: '🎤', text: 'Помоги подготовить речь' },
  { emoji: '📱', text: 'Подбери полезные приложения' },
  { emoji: '✍️', text: 'Напиши письмо' },
  { emoji: '🏖️', text: 'Организуй отпуск' },
  { emoji: '💼', text: 'Подготовь к собеседованию' },
  { emoji: '🎁', text: 'Посоветуй подарок' },
  { emoji: '🛋️', text: 'Предложи идеи для декора' },
  { emoji: '✈️', text: 'Построй маршрут путешествия' },
  { emoji: '📄', text: 'Объясни сложный документ' }, // замена
  { emoji: '🛠️', text: 'Объясни, как настроить гаджеты' }, // замена
  { emoji: '🦸‍♂️', text: 'Придумай супергероя' }, // замена
  { emoji: '✈️', text: 'Дай советы для поездки в новую страну' }, // замена
  { emoji: '💬', text: 'Дай советы для выступления' }, // замена

  { emoji: '✈️', text: 'Рассчитай сложные проценты' },
  { emoji: '✈️', text: 'Напиши стихотворение о любви?' },
  { emoji: '✈️', text: 'Где хорошая погода на выходных?' },
  { emoji: '✈️', text: 'Изобрази Москву в стиле Дали' },
  { emoji: '✈️', text: 'Как написать функцию на Python...' },
  { emoji: '✈️', text: 'Объясни, как решить интеграл' },
];

const newMessageText = ref('');
const targetText = ref(prompts[0].text);

function getRandomPrompts(count = 3) {
  const shuffled = prompts.sort(() => 0.5 - Math.random());
  return shuffled.slice(0, count);
}

onMounted(() => {
  let index = 0;
  let phase = 1;
  const caret = '⬤';

  function typeText() {
    if (index >= targetText.value.length + 10) {
      phase = -1;
    }

    if (index <= 1) {
      targetText.value = getRandomPrompts(1)[0].text;
      phase = 1;
    }

    newMessageText.value = targetText.value.substring(0, index + phase) + caret;
    index += phase;
    setTimeout(typeText, 42);
  }
  typeText();
});
</script>
<style>
.msg-btn {
  transition: ease-in-out 0.2s;
}

.msg-btn:hover {
  transform: rotate(-90deg);
}
</style>
