export default [
  {
    id: 'faq-version',
    question: 'Как и на какой версии работает WowGPT?',
    answer: `WowGPT предоставляет доступ ChatGPT 4o или ChatGPT 4o mini в зависимости от трафика.
    Мы стремимся поддерживать актуальную версию, чтобы предоставить вам наиболее точный и полезный функционал.`,
  },
  {
    id: 'faq-limits',
    question: 'Что будет, если исчерпаются лимиты сообщений на день?',
    answer: `Если ваш лимит сообщений на день исчерпан, вы можете активировать Daily Boost — это тариф,
    который дает больше сообщений на один день, чтобы покрыть внезапные потребности.
    Также можно дождаться обновления лимита на следующий день.`,
  },
  {
    id: 'faq-msg-count',
    question: 'Как рассчитывается количество сообщений, указанное в тарифах?',
    answer: `Каждый ответ WowGPT считается одним сообщением.
    Это может быть вопрос, запрос на редактирование текста, создание кода, генерация изображения и т.д.`,
  },
  {
    id: 'faq-support',
    question: 'Если у меня возникнут вопросы или сложности, мне помогут?',
    answer: `Да, наша служба поддержки готова помочь вам с любыми вопросами.
    Вы можете связаться с нами по электронной почте.`,
  },
  {
    id: 'faq-img-gen',
    question: 'Что используется для генерации изображений?',
    answer: `Kandinsky 3.1 — это нейросеть для генерации изображений,
    созданная на основе передовых технологий искусственного интеллекта.
    Она позволяет создавать оригинальные иллюстрации по вашему описанию.`,
  },
];
