export default [
  {
    title: '💡 Легкость использования',
    text: 'Используйте мощь ChatGPT без ограничений',
  },
  {
    title: '🔓 Доступ без VPN и зарубежных карт',
    text: 'Работайте без ограничений в России',
  },
  {
    title: '🪆 Поддержка русского языка',
    text: 'Полностью адаптирован для работы с русскоязычными пользователями',
  },
  {
    title: '💸 Доступные тарифы',
    text: 'Гибкие планы, включая бесплатный старт для всех категорий пользователей',
  },
  {
    title: '🔗 Интеграция с сервисами',
    text: 'Новости, погода, поиск и создание изображений',
  },
];
